## Installation

In [ ]:
pip install PyMySql

In [ ]:
pip install mysql-connector

In [81]:
import mysql.connector

## Creating SQL connection and connect

In [82]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Aia#9812"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000023CD16E54C0>

In [83]:
cursor = mydb.cursor()

cursor.execute("SHOW DATABASES")

In [84]:
for x in cursor:
    print(x)

('abcd',)
('attrition',)
('cars',)
('demo1',)
('fake',)
('indian_cars',)
('information_schema',)
('ipl',)
('joins',)
('mydb',)
('mysql',)
('performance_schema',)
('practice',)
('sakila',)
('students',)
('sys',)
('world',)

In [85]:
cursor.execute("USE students")

In [86]:
cursor.execute("show tables")

In [87]:
for x in cursor:
    print(x)

('student',)
('students1',)

In [88]:
cursor.execute("SELECT * FROM students1")

In [89]:
for x in cursor:
    print(x)

(1, 'sanket', 'stat', 'A')
(2, 'shrya', 'mvs', 'B')
(3, 'vijay', 'infarence', 'C')
(4, 'akash', 'maths', 'c')
(5, 'akshay', 'hindi', 'B')
(6, 'viraj', 'marathi', 'B')
(9, 'Aakash', 'stat', 'A')
(10, 'Prakash', 'physics', 'A')

## Insert Records in Table

In [90]:
query = "INSERT INTO students1 (name,sub,grade) VALUES (%s,%s,%s)"
values = ("Aakash","physics","A")
cursor.execute(query,values)
print("Row inserted",cursor.lastrowid)

Row inserted 11

In [91]:
### Insert multiple records in Table
query = "INSERT INTO student (name, sub,grade) VALUES (%s,%s, %s)"
values = [("shivani", "Stat","A"),
        ("Joe", "maths","B"),
        ("Ankur","math","B"),
        ("Paul","eng","A"),
        ("Vishal","Maths","B"),
        ("Krish","stat","A")]
cursor.executemany(query,values)
print("Row inserted",cursor.lastrowid)

Row inserted 13

#### Select All

In [92]:
cursor = mydb.cursor()
cursor.execute("select*from student")

In [93]:
cursor.fetchall()

[(1, 'ram', 'eng', 'A'),
 (2, 'sham', 'hindi', 'A'),
 (3, 'som', 'hindi', 'A'),
 (4, 'ravi', 'marathi', 'B'),
 (5, 'dipak', 'hindi', 'A'),
 (6, 'mahesh', 'maths', 'C'),
 (7, 'shivani', 'Stat', 'A'),
 (8, 'Joe', 'maths', 'B'),
 (9, 'Ankur', 'maths', 'B'),
 (10, 'Paul', 'eng', 'A'),
 (11, 'Vishal', 'Maths', 'B'),
 (12, 'Krish', 'stat', 'A'),
 (13, 'shivani', 'Stat', 'A'),
 (14, 'Joe', 'maths', 'B'),
 (15, 'Ankur', 'math', 'B'),
 (16, 'Paul', 'eng', 'A'),
 (17, 'Vishal', 'Maths', 'B'),
 (18, 'Krish', 'stat', 'A')]

### We can update existing records in a table by using the "UPDATE" statement:

In [94]:
query="UPDATE students1 SET name = 'Prakash' WHERE roll_no = '10'"
cursor.execute(query)
mydb.commit()
print(cursor.rowcount, "record(s) affected")

0 record(s) affected

In [95]:
query="UPDATE student SET sub = 'maths' WHERE roll_no = '9'"
cursor.execute(query)
mydb.commit()
print(cursor.rowcount, "record(s) affected")

0 record(s) affected

In [96]:
cursor = mydb.cursor()
#cursor.execute("select*from students1")
cursor.execute("select*from student")

In [97]:
cursor.fetchall()

[(1, 'ram', 'eng', 'A'),
 (2, 'sham', 'hindi', 'A'),
 (3, 'som', 'hindi', 'A'),
 (4, 'ravi', 'marathi', 'B'),
 (5, 'dipak', 'hindi', 'A'),
 (6, 'mahesh', 'maths', 'C'),
 (7, 'shivani', 'Stat', 'A'),
 (8, 'Joe', 'maths', 'B'),
 (9, 'Ankur', 'maths', 'B'),
 (10, 'Paul', 'eng', 'A'),
 (11, 'Vishal', 'Maths', 'B'),
 (12, 'Krish', 'stat', 'A'),
 (13, 'shivani', 'Stat', 'A'),
 (14, 'Joe', 'maths', 'B'),
 (15, 'Ankur', 'math', 'B'),
 (16, 'Paul', 'eng', 'A'),
 (17, 'Vishal', 'Maths', 'B'),
 (18, 'Krish', 'stat', 'A')]

### Select Perticular Row

In [98]:
cursor.execute("select * from students1 where name = 'Aakash'")

In [99]:
cursor.fetchall()

[(9, 'Aakash', 'stat', 'A'), (11, 'Aakash', 'physics', 'A')]

## select distinct column

cursor.execute("select distinct sub from student")
cursor.fetchall()

In [100]:
cursor.execute("select name,sub from students1 where name='Aakash' or sub = 'maths'")
cursor.fetchall()

[('akash', 'maths'), ('Aakash', 'stat'), ('Aakash', 'physics')]

## select another database

In [101]:
mydb.cursor()
cursor.execute("show databases")

In [102]:
for x in cursor:
    print(x)

('abcd',)
('attrition',)
('cars',)
('demo1',)
('fake',)
('indian_cars',)
('information_schema',)
('ipl',)
('joins',)
('mydb',)
('mysql',)
('performance_schema',)
('practice',)
('sakila',)
('students',)
('sys',)
('world',)

In [103]:
cursor.execute("use indian_cars")

In [104]:
cursor.execute("show tables")

In [105]:
cursor.fetchall()

[('honda',), ('hyundai',)]

In [21]:
cursor.execute("select * from Honda")

In [12]:
cursor.fetchall()

[(1, 'hatchback', 5, 'petrol', 'brio'),
 (2, 'suv', 5, 'petrol & Diesel', 'CR-V'),
 (3, 'Sedan', 5, 'petrol & Diesel', 'Civic'),
 (4, 'suv', 5, 'petrol & Diesel', 'BR-V'),
 (5, 'Sedan', 5, 'petrol & Diesel', 'City')]

### Alter function

In [46]:
#Add column
cursor.execute("alter table Honda add air_bag int(10)")

In [47]:
cursor.execute("select * from Honda")

In [48]:
cursor.fetchall()

[(1, 'hatchback', 5, 'petrol', 'brio', None),
 (2, 'suv', 5, 'petrol & Diesel', 'CR-V', None),
 (3, 'Sedan', 5, 'petrol & Diesel', 'Civic', None),
 (4, 'suv', 5, 'petrol & Diesel', 'BR-V', None),
 (5, 'Sedan', 5, 'petrol & Diesel', 'City', None)]

#### none values represents air_bag column

In [49]:
#rename column
cursor.execute("ALTER TABLE Honda RENAME COLUMN air_bag TO engine")

In [50]:
cursor.execute("select * from Honda")

In [51]:
cursor.fetchall()

[(1, 'hatchback', 5, 'petrol', 'brio', None),
 (2, 'suv', 5, 'petrol & Diesel', 'CR-V', None),
 (3, 'Sedan', 5, 'petrol & Diesel', 'Civic', None),
 (4, 'suv', 5, 'petrol & Diesel', 'BR-V', None),
 (5, 'Sedan', 5, 'petrol & Diesel', 'City', None)]

#### none values represents engine column

In [52]:
#drop column
cursor.execute("alter table Honda drop engine")

In [53]:
cursor.execute("select * from Honda")

In [54]:
cursor.fetchall()

[(1, 'hatchback', 5, 'petrol', 'brio'),
 (2, 'suv', 5, 'petrol & Diesel', 'CR-V'),
 (3, 'Sedan', 5, 'petrol & Diesel', 'Civic'),
 (4, 'suv', 5, 'petrol & Diesel', 'BR-V'),
 (5, 'Sedan', 5, 'petrol & Diesel', 'City')]

### SQL Count Min, Max, Sum, Avrage Functions

In [55]:
cursor.execute("show databases")

In [57]:
for x in cursor:
    print(x)

('abcd',)
('attrition',)
('cars',)
('demo1',)
('fake',)
('indian_cars',)
('information_schema',)
('ipl',)
('joins',)
('mydb',)
('mysql',)
('performance_schema',)
('practice',)
('sakila',)
('students',)
('sys',)
('world',)

In [58]:
cursor.execute("use attrition")

In [59]:
cursor.execute("show tables")

In [60]:
cursor.fetchall()

[('attrition01',), ('table1',), ('table2',)]

In [61]:
cursor.execute("select * from attrition01")

In [62]:
cursor.fetchall()

[(1,
  41,
  'Travel_Rarely',
  802,
  'Sales',
  1,
  'Life Sciences',
  'Female',
  94,
  'Sales Executive',
  4,
  5993,
  8,
  'Yes',
  11,
  3,
  1,
  6,
  0,
  5),
 (0,
  49,
  'Travel_Frequently',
  279,
  'Research & Development',
  8,
  'Life Sciences',
  'Male',
  61,
  'Research Scientist',
  2,
  5130,
  1,
  'No',
  23,
  4,
  3,
  10,
  1,
  7),
 (1,
  36,
  'Travel_Rarely',
  1373,
  'Research & Development',
  2,
  'Other',
  'Male',
  66,
  'Laboratory Technician',
  3,
  2090,
  6,
  'Yes',
  15,
  3,
  3,
  0,
  0,
  0),
 (0,
  33,
  'Travel_Frequently',
  1392,
  'Research & Development',
  3,
  'Life Sciences',
  'Female',
  56,
  'Research Scientist',
  3,
  2909,
  1,
  'Yes',
  11,
  3,
  3,
  8,
  3,
  0),
 (0,
  27,
  'Travel_Rarely',
  591,
  'Research & Development',
  2,
  'Medical',
  'Male',
  40,
  'Laboratory Technician',
  2,
  3468,
  9,
  'No',
  12,
  3,
  3,
  2,
  2,
  2),
 (0,
  32,
  'Travel_Frequently',
  1005,
  'Research & Development',
  2,
  'Life Sciences',
  'Male',
  79,
  'Laboratory Technician',
  4,
  3068,
  0,
  'No',
  13,
  3,
  2,
  7,
  3,
  6),
 (0,
  36,
  'Travel_Rarely',
  1324,
  'Research & Development',
  3,
  'Medical',
  'Female',
  81,
  'Laboratory Technician',
  1,
  2670,
  4,
  'Yes',
  20,
  4,
  2,
  1,
  0,
  0),
 (0,
  30,
  'Travel_Rarely',
  1358,
  'Research & Development',
  24,
  'Life Sciences',
  'Male',
  67,
  'Laboratory Technician',
  3,
  2693,
  1,
  'No',
  22,
  4,
  3,
  1,
  0,
  0),
 (0,
  38,
  'Travel_Frequently',
  216,
  'Research & Development',
  23,
  'Life Sciences',
  'Male',
  44,
  'Manufacturing Director',
  3,
  9526,
  0,
  'No',
  21,
  4,
  3,
  9,
  1,
  8),
 (0,
  36,
  'Travel_Rarely',
  1299,
  'Research & Development',
  27,
  'Medical',
  'Male',
  94,
  'Healthcare Representative',
  3,
  5237,
  6,
  'No',
  13,
  3,
  2,
  7,
  7,
  7),
 (0,
  35,
  'Travel_Rarely',
  809,
  'Research & Development',
  16,
  'Medical',
  'Male',
  84,
  'Laboratory Technician',
  2,
  2426,
  0,
  'No',
  13,
  3,
  3,
  5,
  0,
  3),
 (0,
  29,
  'Travel_Rarely',
  153,
  'Research & Development',
  15,
  'Life Sciences',
  'Female',
  49,
  'Laboratory Technician',
  3,
  4193,
  0,
  'Yes',
  12,
  3,
  3,
  9,
  0,
  8),
 (0,
  31,
  'Travel_Rarely',
  670,
  'Research & Development',
  26,
  'Life Sciences',
  'Male',
  31,
  'Research Scientist',
  3,
  2911,
  1,
  'No',
  17,
  3,
  2,
  5,
  4,
  3),
 (0,
  34,
  'Travel_Rarely',
  1346,
  'Research & Development',
  19,
  'Medical',
  'Male',
  93,
  'Laboratory Technician',
  4,
  2661,
  0,
  'No',
  11,
  3,
  3,
  2,
  1,
  2),
 (1,
  28,
  'Travel_Rarely',
  103,
  'Research & Development',
  24,
  'Life Sciences',
  'Male',
  50,
  'Laboratory Technician',
  3,
  2028,
  5,
  'Yes',
  14,
  3,
  3,
  4,
  0,
  3),
 (0,
  29,
  'Travel_Rarely',
  1389,
  'Research & Development',
  21,
  'Life Sciences',
  'Female',
  51,
  'Manufacturing Director',
  1,
  9980,
  1,
  'No',
  11,
  3,
  3,
  10,
  8,
  8),
 (0,
  32,
  'Travel_Rarely',
  334,
  'Research & Development',
  5,
  'Life Sciences',
  'Male',
  80,
  'Research Scientist',
  2,
  3298,
  0,
  'Yes',
  12,
  3,
  2,
  6,
  0,
  5),
 (0,
  22,
  'Non-Travel',
  1123,
  'Research & Development',
  16,
  'Medical',
  'Male',
  96,
  'Laboratory Technician',
  4,
  2935,
  1,
  'Yes',
  13,
  3,
  2,
  1,
  0,
  0),
 (0,
  38,
  'Travel_Rarely',
  371,
  'Research & Development',
  2,
  'Life Sciences',
  'Male',
  45,
  'Research Scientist',
  4,
  3944,
  5,
  'Yes',
  11,
  3,
  3,
  3,
  1,
  2),
 (0,
  24,
  'Non-Travel',
  673,
  'Research & Development',
  11,
  'Other',
  'Female',
  96,
  'Manufacturing Director',
  3,
  4011,
  0,
  'No',
  18,
  3,
  2,
  4,
  1,
  3),
 (1,
  36,
  'Travel_Rarely',
  1218,
  'Sales',
  9,
  'Life Sciences',
  'Male',
  82,
  'Sales Representative',
  1,
  3407,
  7,
  'No',
  23,
  4,
  3,
  5,
  0,
  3),
 (0,
  21,
  'Travel_Rarely',
  391,
  'Research & Development',
  15,
  'Life Sciences',
  'Male',
  96,
  'Research Scientist',
  4,
  1232,
  1,
  'No',
  14,
  3,
  3,
  0,
  0,
  0),
 (1,
  34,
  'Travel_Rarely',
  699,
  'Research & Development',
  6,
  'Medical',
  'Male',
  83,
  'Research Scientist',
  1,
  2960,
  2,
  'No',
  11,
  3,
  3,
  4,
  1,
  3),
 (1,
  32,
  'Travel_Frequently',
  1125,
  'Research & Development',
  16,
  'Life Sciences',
  'Female',
  72,
  'Research Scientist',
  1,
  3919,
  1,
  'Yes',
  22,
  4,
  3,
  10,
  6,
  7),
 (0,
  42,
  'Travel_Rarely',
  691,
  'Sales',
  8,
  'Marketing',
  'Male',
  48,
  'Sales Executive',
  2,
  6825,
  0,
  'No',
  11,
  3,
  3,
  9,
  4,
  2),
 (0,
  44,
  'Travel_Rarely',
  477,
  'Research & Development',
  7,
  'Medical',
  'Female',
  42,
  'Healthcare Representative',
  4,
  10248,
  3,
  'No',
  14,
  3,
  3,
  22,
  5,
  17),
 (0,
  33,
  'Travel_Rarely',
  924,
  'Research & Development',
  2,
  'Medical',
  'Male',
  78,
  'Laboratory Technician',
  4,
  2496,
  4,
  'No',
  11,
  3,
  3,
  1,
  0,
  0),
 (0,
  44,
  'Travel_Rarely',
  1459,
  'Research & Development',
  10,
  'Other',
  'Male',
  41,
  'Healthcare Representative',
  4,
  6465,
  2,
  'Yes',
  13,
  3,
  4,
  4,
  1,
  3),
 (0,
  30,
  'Travel_Rarely',
  125,
  'Research & Development',
  9,
  'Medical',
  'Male',
  83,
  'Laboratory Technician',
  3,
  2206,
  1,
  'No',
  13,
  3,
  3,
  10,
  1,
  8),
 (1,
  39,
  'Travel_Rarely',
  895,
  'Sales',
  5,
  'Technical Degree',
  'Male',
  56,
  'Sales Representative',
  4,
  2086,
  3,
  'No',
  14,
  3,
  4,
  1,
  0,
  0),
 (1,
  24,
  'Travel_Rarely',
  813,
  'Research & Development',
  1,
  'Medical',
  'Male',
  61,
  'Research Scientist',
  4,
  2293,
  2,
  'Yes',
  16,
  3,
  2,
  2,
  2,
  0),
 (0,
  43,
  'Travel_Rarely',
  1273,
  'Research & Development',
  2,
  'Medical',
  'Female',
  72,
  'Research Scientist',
  3,
  2645,
  1,
  'No',
  12,
  3,
  2,
  5,
  1,
  4),
 (1,
  50,
  'Travel_Rarely',
  869,
  'Sales',
  3,
  'Marketing',
  'Male',
  86,
  'Sales Representative',
  3,
  2683,
  1,
  'Yes',
  14,
  3,
  3,
  3,
  0,
  2),
 (0,
  35,
  'Travel_Rarely',
  890,
  'Sales',
  2,
  'Marketing',
  'Female',
  97,
  'Sales Representative',
  4,
  2014,
  1,
  'No',
  13,
  3,
  3,
  2,
  2,
  2),
 (0,
  36,
  'Travel_Rarely',
  852,
  'Research & Development',
  5,
  'Life Sciences',
  'Female',
  82,
  'Research Scientist',
  1,
  3419,
  9,
  'Yes',
  14,
  3,
  4,
  1,
  0,
  0),
 (0,
  33,
  'Travel_Frequently',
  1141,
  'Sales',
  1,
  'Life Sciences',
  'Female',
  42,
  'Sales Executive',
  1,
  5376,
  2,
  'No',
  19,
  3,
  3,
  5,
  1,
  3),
 (0,
  35,
  'Travel_Rarely',
  464,
  'Research & Development',
  4,
  'Other',
  'Male',
  75,
  'Laboratory Technician',
  4,
  1951,
  1,
  'No',
  12,
  3,
  3,
  1,
  0,
  0),
 (0,
  27,
  'Travel_Rarely',
  1240,
  'Research & Development',
  2,
  'Life Sciences',
  'Female',
  33,
  'Laboratory Technician',
  1,
  2341,
  1,
  'No',
  13,
  3,
  3,
  1,
  0,
  0),
 (1,
  26,
  'Travel_Rarely',
  1357,
  'Research & Development',
  25,
  'Life Sciences',
  'Male',
  48,
  'Laboratory Technician',
  3,
  2293,
  1,
  'No',
  12,
  3,
  2,
  1,
  0,
  1),
 (0,
  27,
  'Travel_Frequently',
  994,
  'Sales',
  8,
  'Life Sciences',
  'Male',
  37,
  'Sales Executive',
  3,
  8726,
  1,
  'No',
  15,
  3,
  3,
  9,
  1,
  7),
 (0,
  30,
  'Travel_Frequently',
  721,
  'Research & Development',
  1,
  'Medical',
  'Female',
  58,
  'Laboratory Technician',
  4,
  4011,
  1,
  'No',
  23,
  4,
  3,
  12,
  3,
  7),
 (0,
  34,
  'Non-Travel',
  1065,
  'Sales',
  23,
  'Marketing',
  'Male',
  72,
  'Sales Executive',
  3,
  4568,
  0,
  'No',
  20,
  4,
  3,
  9,
  8,
  7),
 (0,
  37,
  'Travel_Rarely',
  408,
  'Research & Development',
  19,
  'Life Sciences',
  'Male',
  73,
  'Research Scientist',
  2,
  3022,
  4,
  'No',
  21,
  4,
  3,
  1,
  0,
  0),
 (0,
  46,
  'Travel_Frequently',
  1211,
  'Sales',
  5,
  'Marketing',
  'Male',
  98,
  'Sales Executive',
  4,
  5772,
  4,
  'Yes',
  21,
  4,
  3,
  9,
  0,
  8),
 (0,
  35,
  'Travel_Rarely',
  1229,
  'Research & Development',
  8,
  'Life Sciences',
  'Male',
  36,
  'Laboratory Technician',
  4,
  2269,
  1,
  'No',
  19,
  3,
  3,
  1,
  0,
  1),
 (1,
  48,
  'Travel_Rarely',
  626,
  'Research & Development',
  1,
  'Life Sciences',
  'Male',
  98,
  'Laboratory Technician',
  3,
  5381,
  9,
  'Yes',
  13,
  3,
  3,
  1,
  0,
  0),
 (1,
  28,
  'Travel_Rarely',
  1434,
  'Research & Development',
  5,
  'Technical Degree',
  'Male',
  50,
  'Laboratory Technician',
  3,
  3441,
  1,
  'Yes',
  13,
  3,
  2,
  2,
  2,
  2),
 (0,
  44,
  'Travel_Rarely',
  1488,
  'Sales',
  1,
  'Marketing',
  'Female',
  75,
  'Sales Executive',
  1,
  5454,
  5,
  'Yes',
  21,
  4,
  2,
  4,
  1,
  3)]

In [72]:
#The COUNT() function returns the number of rows that matches a specified criterion.
cursor.execute("select count(MonthlyIncome) from attrition01")

In [73]:
cursor.fetchall()

[(48,)]

In [70]:
#The SUM() function returns the total sum of a numeric column. 
cursor.execute("select SUM(MonthlyIncome) from attrition01")

In [71]:
cursor.fetchall()

[(Decimal('190674'),)]

In [74]:
#The MIN() function returns the smallest value of the selected column.
cursor.execute("select min(MonthlyIncome) from attrition01")

In [75]:
cursor.fetchall()

[(1232,)]

In [76]:
#The MAX() function returns the largest value of the selected column.
cursor.execute("select max(MonthlyIncome) from attrition01")

In [77]:
cursor.fetchall()

[(10248,)]

In [79]:
#The AVG() function returns the average value of a numeric column. 
cursor.execute("select avg(MonthlyIncome) from attrition01")

In [80]:
cursor.fetchall()

[(Decimal('3972.3750'),)]